# OnOpenConflict Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DefaultOpenFromCloudCallback..::..OnOpenConflict Method
DefaultOpenFromCloudCallback Class See Also
---
A method called when the conflict is happen during the model opening.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public virtual OpenConflictResult OnOpenConflict(
	OpenConflictScenario scenario
)
```

Visual Basic
---
```text
Public Overridable Function OnOpenConflict ( _
	scenario As OpenConflictScenario _
) As OpenConflictResult
```

Visual C++
---
```text
public:
virtual OpenConflictResult OnOpenConflict(
	OpenConflictScenario scenario
)
```

# ### Parameters
scenario
    Type: Autodesk.Revit.DB..::..OpenConflictScenario The scenario of the conflict.
# ### Return Value
Returns the result to indicate whether to keep the unsynchronized change, or open the latest version or cancel the open action.
# ### Implements
IOpenFromCloudCallback..::..OnOpenConflict(OpenConflictScenario)
# See Also
DefaultOpenFromCloudCallback Class
Autodesk.Revit.DB Namespace